NextFOAM-2509/tutorials/lagrangian/reactingParcelFoam/rivuletPanel/system/wallFilmRegion/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         none;
    grad(pL)        Gauss linear;
    grad(sigmaf)    Gauss linear;
    snGradCorr(deltaf) Gauss linear;
    snGradCorr(pp)  Gauss linear;
    snGradCorr(pu)  Gauss linear;
    grad(nHat)  Gauss linear;

    grad(alpha)     Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,Uf)     Gauss upwind;
    div(phid,deltaf) Gauss upwind;
    div(phi,hf)     Gauss upwind;
}

laplacianSchemes
{
    default         none;
    laplacian(sigmaf,deltaf) Gauss linear orthogonal;
    laplacian(deltaCoeff,deltaf) Gauss linear orthogonal;
}

snGradSchemes
{
    snGrad(p)       orthogonal;
    snGrad(deltaf)  orthogonal;
}


// ************************************************************************* //
